{
	"projects": [{
		"name": "About Sam",
		"subdomain": "aboutMe",
		"category": ["tangible", "networked", "participatory", "publication", "lead", "methods"],
		"subtitle": "Jack of all Trades",
		"collaborators": ["Kaiwen Sun", "Zahra Dhuliawala", "Fumi Tsukiyama", "Iva Matkovic", "Anastasia Wolf", "Zihao (Leo) Zhang", "Priyanka Balasubramaniyam", "Zach Schwemler", "Allison Druin", "Jason Yip", "Amanda Huynh", "Daniel Leithinger"],
		"abstract": "As a Jack-of-all trades I am always keeping busy. I am a skateboarder for more than ten years and am currently ride for a local skateshop, Loco Skate Shop in Longmont Colorado. Also an advid lover of adventuring and exploring new places, be it here in Colorado or further. Though I always find time to create new things, be it rugs or artwork, 3D models, or programs and games",
		"description": ["In Human-Computer Interaction, children have been active participants in co-designing future technologies for other children. Most studies in co-design (prior to COVID-19), focused on co-located in-person sessions that involved physical techniques, such as hand-drawn and crafted prototypes, acting out scenarios, and playing movement games to generate ideas. However, these physically proximal activities are not possible online. This lack of physical engagement creates barriers and leaves children feeling less creative and engaged in the remote co-design process.", "To workaround this situation in which children are co-designing online, we have worked with KidsTeam UW to create another option for remote co-design: tangible interfaces for remote co-design. Our project, Together Apart, uses toio tabletop robots and a tablet interface to add a tangible dimension to online co-design. When using our system, our child design partners acted in an engaged manner not typically seen in remote settings.", "While working together online, KidsTeam UW children used our toio robotics system to design games, swarm robot expressions, and create physical art together. For our workshop contribution, we will showcase some of our work-in-progress and develop potential collaborations for tangible online co-design. In the future we plan to move from a fully remote environment to a hybrid environment for co-design. We will engage in conversations with KidsTeam UW about how tangible interfaces for hybrid environments differ from fully online contexts."],
		"mainimg": "tapart.jpg",
		"video": ["False"],
		"images": ["./images/cyberfrog/cyberfrog.jpg", "./images/cyberfrog/cyberfrogAction.jpg", "./images/cyberfrog/cyberfrogPrototype.jpg", "./images/cyberfrog/cyberfrogBattleMode.jpg", "./images/cyberfrog/cyberfrogAward.jpg", "./images/cyberfrog/Space Grant.jpg"],
		"published": ["True","1"],
		"citations": [["Casey Lee Hunt, Kaiwen Sun, Zahra Dhuliawala, Fumi Tsukiyama, Iva Matkovic, Zachary Schwemler, Anastasia Wolf, Zihao Zhang, Allison Druin, Amanda Huynh, Daniel Leithinger, and Jason Yip. 2023. <span>Designing Together, Miles Apart: A Longitudinal Tabletop Telepresence Adventure in Online Co-Design with Children</span>. In Proceedings of the 22nd Annual ACM Interaction Design and Children Conference (IDC '23). Association for Computing Machinery, New York, NY, USA, 52–67.", "https://caseyhunt.github.io/assets/idc23-8_3.pdf", "View on ACM", "https://dl-acm-org.colorado.idm.oclc.org/doi/10.1145/3585088.3589359"]]
		
},{
			"name": "Cyberfrog",
			"subdomain": "cyberfrog",
			"category": ["tangible", "networked", "participatory", "publication", "lead", "methods"],
			"subtitle": "The Colorado Nasa Space Grant Project",
			"collaborators": ["Kaiwen Sun", "Zahra Dhuliawala", "Fumi Tsukiyama", "Iva Matkovic", "Anastasia Wolf", "Zihao (Leo) Zhang", "Priyanka Balasubramaniyam", "Zach Schwemler", "Allison Druin", "Jason Yip", "Amanda Huynh", "Daniel Leithinger"],
			"abstract": "This is the FRCC Cyberfrog! At Front Range Community College I had the oppertunity and privalege to lead the robotics team. Going on to lead the team to participate in the NASA Colorado Space Grand Consortium, where we were tasked with creating an autonomous mars rover the size of a house cat.",
			"description": ["In Human-Computer Interaction, children have been active participants in co-designing future technologies for other children. Most studies in co-design (prior to COVID-19), focused on co-located in-person sessions that involved physical techniques, such as hand-drawn and crafted prototypes, acting out scenarios, and playing movement games to generate ideas. However, these physically proximal activities are not possible online. This lack of physical engagement creates barriers and leaves children feeling less creative and engaged in the remote co-design process.", "To workaround this situation in which children are co-designing online, we have worked with KidsTeam UW to create another option for remote co-design: tangible interfaces for remote co-design. Our project, Together Apart, uses toio tabletop robots and a tablet interface to add a tangible dimension to online co-design. When using our system, our child design partners acted in an engaged manner not typically seen in remote settings.", "While working together online, KidsTeam UW children used our toio robotics system to design games, swarm robot expressions, and create physical art together. For our workshop contribution, we will showcase some of our work-in-progress and develop potential collaborations for tangible online co-design. In the future we plan to move from a fully remote environment to a hybrid environment for co-design. We will engage in conversations with KidsTeam UW about how tangible interfaces for hybrid environments differ from fully online contexts."],
			"mainimg": "tapart.jpg",
			"video": ["False"],
			"images": ["./images/cyberfrog/cyberfrog.jpg", "./images/cyberfrog/cyberfrogAction.jpg", "./images/cyberfrog/cyberfrogPrototype.jpg", "./images/cyberfrog/cyberfrogBattleMode.jpg", "./images/cyberfrog/cyberfrogAward.jpg", "./images/cyberfrog/Space Grant.jpg"],
			"published": ["True","1"],
			"citations": [["Casey Lee Hunt, Kaiwen Sun, Zahra Dhuliawala, Fumi Tsukiyama, Iva Matkovic, Zachary Schwemler, Anastasia Wolf, Zihao Zhang, Allison Druin, Amanda Huynh, Daniel Leithinger, and Jason Yip. 2023. <span>Designing Together, Miles Apart: A Longitudinal Tabletop Telepresence Adventure in Online Co-Design with Children</span>. In Proceedings of the 22nd Annual ACM Interaction Design and Children Conference (IDC '23). Association for Computing Machinery, New York, NY, USA, 52–67.", "https://caseyhunt.github.io/assets/idc23-8_3.pdf", "View on ACM", "https://dl-acm-org.colorado.idm.oclc.org/doi/10.1145/3585088.3589359"]]
			
	},{		
			"name": "Blender Projects",
			"subdomain": "blender",
			"category": ["tangible", "networked", "participatory", "toolkit", "shape_change", "publication", "award", "support"],
			"subtitle": "A mix of Blender Projects",
			"collaborators": ["Ran Zhou (Lead)", "Zachary Schwemler","Aksha Baweja", "Harpreet Sareen", "Daniel Leithinger"],
			"abstract": "I have a passion for 3D art not only in video games, but as a median. These are just a few examples of my work developed in Blender. This is a bunch of filler text to see if the more text imputed fixes the alignment issue I was getting. So I ask how is your day going? Mine is well, thanks for asking.",
			"description": ["Psychological research has found that humans convey specific emotions (e.g., anger, fear, happiness) using social touch patterns, like squeezing a friend's arm when we are afraid. Emotional haptics, then, are an opportunity to create more enriching and intimate interactions with technology. However, designing emotional haptics systems requires a relatively high degree of technical skill. To overcome this challenge and make emotional haptics an accessible 'design canvas,' we created TactorBots."
			, "TactorBots is a haptic toolkit to create emotional robotic touch. It contains eight plug-and-play wearable tactor modules that render a series of social gestures with servo motors. The associated web GUI allows easy control, modification, and storage of tactile patterns to support fast prototyping. As a result, we remove the need for hardware design and programming, enabling designers to try out various tactile sensations, and create at the boundary between touch and emotion."],
			"mainimg": "tbots_cover.png",
			"video": ["True","False"],
			"images": ["tbots_cover.png"],
			"video_url": "https://player.vimeo.com/video/798871223?h=dafa20ef89",
			"published": ["True","1"],
			"citations": [["Ran Zhou, Zachary Schwemler, Akshay Baweja, Harpreet Sareen, Casey Lee Hunt, and Daniel Leithinger. 2023. <span>TactorBots: A Haptic Design Toolkit for Out-of-lab Exploration of Emotional Robotic Touch.</span> In Proceedings of the 2023 CHI Conference on Human Factors in Computing Systems (CHI '23). Association for Computing Machinery, New York, NY, USA, Article 370, 1–19.", "https://caseyhunt.github.io/assets/chi-23.pdf", "View on ACM", "https://dl-acm-org.colorado.idm.oclc.org/doi/abs/10.1145/3544548.3580799"]]

	},{
			"name": "One-Button Game",
			"subdomain": "deepDive",
			"category": ["tangible", "participatory", "educational", "publication", "lead", "education"],
			"subtitle": "Deep Dive, a submarine based game",
			"collaborators": ["Chris Hill (Co-Lead)", "Sammie Crowder", "Brett Fielder", "Emily Moore", "Ann Eisenberg"],
			"abstract": "Deep dive is a One-Button game thaat uses the theme of underwater maritime theme. A simple flappy bird clone, how long can you survive? This is a bunch of filler text to see if the more text imputed fixes the alignment issue I was getting. So I ask how is your day going? Mine is well, thanks for asking.",
			"description": ["Sensory extensions enhance our awareness by transforming variations in stimuli normally undetectable by human senses into perceivable outputs. Similarly, interactive simulations for learning promote an understanding of abstract phenomena. Combining sensory extension devices with interactive simulations gives users the novel opportunity to connect their sensory experiences in the physical world to computer-simulated concepts. We explore this opportunity by designing a suite of wearable sensory extension devices that interface with a uniquely inclusive PhET Simulation, Ratio and Proportion. In this simulation, two hands can be moved on-screen to various values, representing different mathematical ratios. Users explore changing hand heights to find and maintain ratios through visual and auditory feedback. Our sensory extension devices translate force, distance, sound frequency, and magnetic field strength to quantitative values in order to control individual hands in the computer simulation. This paper describes the design of the devices and our analysis of feedback from 23 high-school aged youth who used our designs to interact with the Ratio and Proportion."],
			"mainimg": "sensoryextension_cover.jpg",
			"video": ["True","True"],
			"images": ["sensoryextension_cover.jpg", "sensory_extension_render.png", "using_se.jpg"],
			"video_id": "naIZ2wla7WA",
			"published": ["True","1"],
			"citations": [["Chris Hill, Casey Lee Hunt, Sammie Crowder, Brett Fiedler, Emily B. Moore, and Ann Eisenberg. 2023. <span>Investigating Sensory Extensions as Input for Interactive Simulations</span>. In Proceedings of the Seventeenth International Conference on Tangible, Embedded, and Embodied Interaction (TEI '23). Association for Computing Machinery, New York, NY, USA, Article 39, 1–7.", "https://caseyhunt.github.io/assets/tei-23.pdf", "View on ACM", "https://dl-acm-org.colorado.idm.oclc.org/doi/abs/10.1145/3569009.3573108"]]

		},{
			"name": "Art Projects",
			"subdomain": "artwork",
			"category": ["tangible", "participatory", "lead"],
			"subtitle": "Ambient Community Wellness Display ",
			"collaborators": ["Ruojia Sun", "Kit Lewers", "Sandra Bae", "Steve Voida"],
			"abstract": "An ambient display that invites students and faculty to share and reflect on their stress as a community. With a combination of self-reported and biometric data, the community controls each robotic flower in the bouquet to record stress via closed or blooming buds.",
			"description": ["We are inspired by related work in ambient displays as a promising technology for community wellness interfaces. Ambient displays are particularly applicable to community wellness, since they are well-suited for enabling continuous, background awareness of general states of large systems. There have been several works which use ambient displays to support mental wellness and stress management. For example, MoodLight is an interactive ambient lighting system that responds to epidermal activity biosensor data related to the user’s stress level. ", "With Cyber Garden, we design an ambient display for graduate students to report personal stress through biometrics and self-reported data. We use this data to create an anonymized, interactive visualization. We leverage previous workshops conducted with graduate students to ground our approach. When asked about burnout, these graduate students shared a desire to reach out for help, but reported not having a clear mechanism to do so. Additionally, these students reported that they would feel less alone in their difficult emotions if there was a way to see the challenging states of others."],
			"mainimg": "cgarden.jpeg",
			"video": ["False"],
			"images": ["cgarden.jpeg", "garden_display.jpeg", "garden_full.jpeg"]
		}

		]



	}